In [27]:
from bs4 import BeautifulSoup 
import requests

In [28]:
url = "https://sandiego.craigslist.org/d/cars-trucks/search/cta"

In [29]:
# Opening up connection, grabbing page
page = requests.get(url)

# Html parsing
soup = BeautifulSoup(page.content, "html.parser")

# Grab each product
containers = soup.findAll("li",{"class": "result-row"})

In [33]:
len(containers)

120

In [34]:
print(containers[0])

<li class="result-row" data-pid="7486389225" data-repost-of="7483454014">
<a class="result-image gallery" data-ids="3:00808_931t43pxn9ez_0x20oM,3:01212_1wgFvrOXOMhz_0x20oM,3:00e0e_4UgApO1dlwyz_0x20oM,3:00l0l_3pjpHHxJiUVz_0x20oM,3:00U0U_g3tUQuq6vJiz_0x20oM,3:00N0N_dsdNA5350vCz_0x20oM,3:01111_betf0Uyfpsoz_0x20oM,3:00i0i_g5fJkh1PTWqz_0x20oM,3:00k0k_gurCDewp1Qcz_0x20oM,3:01111_aCUm599sC0fz_0x20oM,3:00707_dGJUr4GuQS0z_0x20oM,3:00y0y_bHP4WREy80ez_0x20oM,3:00t0t_bE5Gaz7z7sfz_0x20oM,3:00G0G_8evP5kKOddVz_0x20oM,3:00V0V_hiFYzegebbjz_0x20oM,3:00808_4YrFG9H5h9kz_0x20oM,3:00M0M_cCzCSrbI2Axz_0x20oM,3:00a0a_lEcbgR5pYWez_0x20oM,3:01414_k35FnSghuVkz_0x20oM,3:00r0r_hgjkgYqjuQHz_0x20oM" href="https://sandiego.craigslist.org/csd/ctd/d/san-diego-2007-ford-150-xlt-super-crew/7486389225.html">
<span class="result-price">$10,495</span>
</a>
<div class="result-info">
<span class="icon icon-star" role="button">
<span class="screen-reader-text">favorite this post</span>
</span>
<time class="result-date" datetime="2022-05-20 22:41" title="Fri 20 May 10:41:45 PM">May 20</time>
<h3 class="result-heading">
<a class="result-title hdrlnk" data-id="7486389225" href="https://sandiego.craigslist.org/csd/ctd/d/san-diego-2007-ford-150-xlt-super-crew/7486389225.html" id="postid_7486389225">2007 Ford F-150 XLT Super Crew cab Clean Title *Finance Available</a>
</h3>
<span class="result-meta">
<span class="result-price">$10,495</span>
<span class="result-hood"> (San Diego)</span>
<span class="result-tags">
<span class="pictag">pic</span>
</span>
<span class="banish icon icon-trash" role="button">
<span class="screen-reader-text">hide this posting</span>
</span>
<span aria-hidden="true" class="unbanish icon icon-trash red" role="button"></span>
<a class="restore-link" href="#">
<span class="restore-narrow-text">restore</span>
<span class="restore-wide-text">restore this posting</span>
</a>
</span>
</div>
</li>

In [35]:
# Grab the first 15 containers
for container in containers[:15]:
    # Grab data from html
    car = container.div.a.text
    price = container.a.span.text
    print(car)
    print(price+'\n')

2007 Ford F-150 XLT Super Crew cab Clean Title *Finance Available
$10,495

2016 Ford Explorer EXTRA CLEAN, EQ W REAR CAM!!
$23,900

2011 Honda Odyssey EX MODEL, LEATHER INT, AUTO SIDE DOORS.!!
$13,900

2019 Ford Ranger ONLY 44K MILES!!!
$33,900

2017 Toyota Sienna XLE MODEL, SUNROOF, LEATHER, REAR CAM, ONLY 30K MI
$24,900

2015 Toyota Tacoma Access Cab I4 4AT 2WD
$17,900

2013 Acura ILX 5-Spd AT w/ Premium Package
$13,900

2013 Honda Accord ONLY 59K MILES!!!
$18,900

2011 Jeep Patriot ONLY 75K MILES!!!
$10,900

2013 Ford Escape EQ W TOW PACKAGE AND ROOF RACK!!
$13,900

2014 Mercedes-Benz CLA-Class LEATHER INT., ONLY 80K MILES!!!
$18,900

2018 Hyundai Tucson SEL Plus
$16,900

2018 Chevrolet Colorado 2WD, REAR CAM, EXT CAB.
$18,900

2010 Mercedes-Benz E-Class ONLY 80K MILES!!!
$16,900

2012 Jeep Grand Cherokee Laredo 2WD
$14,900

In [36]:
def numerize(price):
    # Change car price txt to ints
    number = list(price)

    try:
        number.remove(',')
        number.remove('$')
        return int(''.join(number))
    except (ValueError):
        return 0

In [55]:
dict = {}
cars = []
prices = []
for container in containers:
    car = container.div.a.text
    cars.append(car)
    price = numerize(container.a.span.text)
    prices.append(price)

dict['Car'] = cars
dict['Price'] = prices
print(dict['Price'][0])

10495

In [56]:
import pandas as pd
import numpy as np

In [57]:
df = pd.DataFrame(dict)

In [58]:
df

                                                   Car  Price
0    2007 Ford F-150 XLT Super Crew cab Clean Title...  10495
1      2016 Ford Explorer EXTRA CLEAN, EQ W REAR CAM!!  23900
2    2011 Honda Odyssey EX MODEL, LEATHER INT, AUTO...  13900
3                   2019 Ford Ranger ONLY 44K MILES!!!  33900
4    2017 Toyota Sienna XLE MODEL, SUNROOF, LEATHER...  24900
..                                                 ...    ...
115  2017 Honda Fit SUNROOF, REAR CAM, AND PUSH TO ...  13900
116        2012 Jeep Wrangler Unlimited 4WD 4dr Sahara  29900
117                    2006 Scion xA ONLY 56K MILES!!!  12900
118  2018 Ford Super Duty F-250 Super Duty 4x4, Eq ...  34900
119  2005 Honda Pilot EX-L MODEL, LEATHER INT, ONLY...  12900

[120 rows x 2 columns]

In [59]:
df.describe()

              Price
count    120.000000
mean   20729.958333
std    10207.426167
min     7900.000000
25%    12900.000000
50%    17900.000000
75%    25150.000000
max    68900.000000

In [60]:
# Get rid of all cars with no price
df = df.replace(0, np.nan)
df2 = df.dropna(subset=['Price'])

In [43]:
len(df2)

50

In [44]:
df2.describe()

              Price
count     50.000000
mean   21711.900000
std    11885.770042
min     7900.000000
25%    13900.000000
50%    18900.000000
75%    23900.000000
max    68900.000000